content/notes/a_tool_for_thinking.md
---
title: "A Tool For Thinking"
author: ["Darrell Banks"]
date: 2025-10-21T00:00:00-06:00
lastmod: 2025-11-26T00:00:00-07:00
tags: ["notes"]
draft: false
---

**Connections**:


## Ink.sh {#ink-dot-sh}


### Seamless tri-modal editor—text, sketch, and auto-generated quiz in one file that stays in sync (today you usually export→import). {#seamless-tri-modal-editor-text-sketch-and-auto-generated-quiz-in-one-file-that-stays-in-sync--today-you-usually-export-import--dot}


### Cite-as-you-go – auto-append source links so when you turn notes into a quiz you can click back to the exact paragraph or diagram that justified the answer. {#cite-as-you-go-auto-append-source-links-so-when-you-turn-notes-into-a-quiz-you-can-click-back-to-the-exact-paragraph-or-diagram-that-justified-the-answer-dot}


### Vertical packs – pre-loaded evaluation criteria for specific fields (med-school anatomy image quizzes, CFA-formula flashcards, etc.). {#vertical-packs-pre-loaded-evaluation-criteria-for-specific-fields--med-school-anatomy-image-quizzes-cfa-formula-flashcards-etc-dot--dot}


### Knowledge graph view – auto-layout of concepts as you take notes; click a node → instantly generate a cloze deletion quiz or a mind-map image for slides. {#knowledge-graph-view-auto-layout-of-concepts-as-you-take-notes-click-a-node-instantly-generate-a-cloze-deletion-quiz-or-a-mind-map-image-for-slides-dot}
